# pandas supports two types of data structure
- dataframe: 2d : tabular form
- series: 1 d

## how to create the df
- from pd.read_csv, excel etc: done
- from list/array/tuple
- from dictionary

# from dictionary

In [2]:
import pandas as pd
import numpy as np

# task :

In [1]:
d={}
names=[]
salary=[]
sex=[]
designation=[]
n=int(input("enter the number of employees "))
for i in range(n):
    name=input("enter the name")
    s=input("enter the salary ")
    des=input("enter the designation ")
    g=input("enter the gender ")
    names.append(name)
    salary.append(s)
    designation.append(des)
    sex.append(g)
d["names"]=names
d["salary"]=salary
d["designation"]=designation
d["gender"]=sex
d

enter the number of employees  2
enter the name pranav
enter the salary  50k
enter the designation  trainee
enter the gender  m
enter the name saurabh
enter the salary  60k
enter the designation  associate
enter the gender  m

{'names': ['pranav', 'saurabh'],
 'salary': ['50k', '60k'],
 'designation': ['trainee', 'associate'],
 'gender': ['m', 'm']}

In [4]:
df=pd.DataFrame(d)
df

     names salary designation gender
0   pranav    50k     trainee      m
1  saurabh    60k   associate      m

# from list

In [5]:
n=int(input("enter the number of employees "))
employees=[]
for i in range(n):
    emp=[]
    name=input("enter the name")
    s=input("enter the salary ")
    des=input("enter the designation ")
    g=input("enter the gender ")
    emp.append(name)
    emp.append(s)
    emp.append(des)
    emp.append(g)
    employees.append(emp)
employees

enter the number of employees  2
enter the name pranav
enter the salary  50k
enter the designation  tarinee
enter the gender  m
enter the name saurabh
enter the salary  60k
enter the designation  associate
enter the gender  m

[['pranav', '50k', 'tarinee', 'm'], ['saurabh', '60k', 'associate', 'm']]

In [6]:
pd.DataFrame(employees)

         0    1          2  3
0   pranav  50k    tarinee  m
1  saurabh  60k  associate  m

# customized  columns

In [7]:
pd.DataFrame(employees,columns=["names","salary","des","gender"])

     names salary        des gender
0   pranav    50k    tarinee      m
1  saurabh    60k  associate      m

# customized  index

In [8]:
pd.DataFrame(employees,columns=["names","salary","des","gender"],index=["101","102"])

       names salary        des gender
101   pranav    50k    tarinee      m
102  saurabh    60k  associate      m

# from single list

In [9]:
l=["hena",60000,"engineer","f"]
pd.DataFrame(l,columns=["emp_detail"],index=["name","slaary","des","gender"])

       emp_detail
name         hena
slaary      60000
des      engineer
gender          f

In [10]:
df

     names salary designation gender
0   pranav    50k     trainee      m
1  saurabh    60k   associate      m

# rows  and columns

# rows dealing:

- fetch
- update
- add
- delete

# rows fetching
- head
- tail
- indexing and slicing
   - iloc
   -  loc

 # by default indexing starts from 0 and 
# keys are the names of the columns

In [4]:
data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)  
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [12]:
df.shape

(6, 3)

# head: it fetches the top 5 rows by default

In [13]:
df.head()

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

# tail: it fetches the bottom 5 rows by default

In [14]:
df.tail()

    country   GDP country_type
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [15]:
df.head(2)

  country  GDP country_type
0   india  123   developing
1      uk  123    developed

In [7]:
df.head(50) # whem user give out of range value it returns entire data

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [17]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [24]:
df1=df.sort_values(by=["GDP"]) # by default ascending order
df1

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
5  pakistan   232   developing
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed

In [6]:
df1=df.sort_values(by=["GDP"],ascending=False)
df1

    country   GDP country_type
4    canada  3456    developed
3        us  2134    developed
2   austria   678    developed
5  pakistan   232   developing
0     india   123   developing
1        uk   123    developed

In [19]:
x=df1.head(2)
x

  country   GDP country_type
4  canada  3456    developed
3      us  2134    developed

In [20]:
x["country"]

4    canada
3        us
Name: country, dtype: object

In [8]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# FETCHING: 
- using : 
   - iloc: integer based location
   - loc: text based location

In [9]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# fetch particular row: indexing

In [10]:
s=df.iloc[3]
s

country                us
GDP                  2134
country_type    developed
Name: 3, dtype: object

In [11]:
type(s)

pandas.core.series.Series

In [12]:
s.values

array(['us', 2134, 'developed'], dtype=object)

In [13]:
s.index

Index(['country', 'GDP', 'country_type'], dtype='object')

In [14]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [15]:
df.iloc[4]

country            canada
GDP                  3456
country_type    developed
Name: 4, dtype: object

In [16]:
df.iloc[100]

IndexError: single positional indexer is out-of-bounds

# slicing:["start":"end":stepsize]

In [17]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [18]:
df.iloc[1:5]

   country   GDP country_type
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [19]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [20]:
df[0::2]

   country   GDP country_type
0    india   123   developing
2  austria   678    developed
4   canada  3456    developed

In [21]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [22]:
df[2:]

    country   GDP country_type
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [23]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [24]:
df[:4]

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed

In [25]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [26]:
df[2:6:-2]

Empty DataFrame
Columns: [country, GDP, country_type]
Index: []

In [27]:
df[::-1] # reverse

    country   GDP country_type
5  pakistan   232   developing
4    canada  3456    developed
3        us  2134    developed
2   austria   678    developed
1        uk   123    developed
0     india   123   developing

In [28]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [29]:
df.iloc[0:4,0::2]

   country country_type
0    india   developing
1       uk    developed
2  austria    developed
3       us    developed

In [30]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [31]:
df[0:5,0::2]

InvalidIndexError: (slice(0, 5, None), slice(0, None, 2))

In [32]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [33]:
df.iloc[2:,2]

2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

In [34]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [35]:
df.iloc[[1,2,4]]

   country   GDP country_type
1       uk   123    developed
2  austria   678    developed
4   canada  3456    developed

In [36]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [37]:
df.iloc[:,[1,2]]

    GDP country_type
0   123   developing
1   123    developed
2   678    developed
3  2134    developed
4  3456    developed
5   232   developing

# fetching based on loc

In [38]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# set_index

In [39]:
df.set_index("country",inplace=True)

In [40]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [41]:
df.index

Index(['india', 'uk', 'austria', 'us', 'canada', 'pakistan'], dtype='object', name='country')

In [42]:
df.loc[1]

KeyError: 1

In [43]:
df.loc["canada"]

GDP                  3456
country_type    developed
Name: canada, dtype: object

In [44]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [45]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [46]:
df.loc["uk":"canada"]# end : inclusive

          GDP country_type
country
uk        123    developed
austria   678    developed
us       2134    developed
canada   3456    developed

In [47]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [48]:
df.loc["india":"austria","country_type"]

country
india      developing
uk          developed
austria     developed
Name: country_type, dtype: object

In [49]:
df.iloc[2]

GDP                   678
country_type    developed
Name: austria, dtype: object

# reset_index

In [50]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [51]:
df.reset_index(inplace=True)

In [52]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# update

In [53]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [54]:
df.iloc[1]=["nepal",100,"developing"]
df

    country   GDP country_type
0     india   123   developing
1     nepal   100   developing
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [55]:
df.iloc[2:4]=[["new zealand",340,"developed"],["autralia",600,"developed"]]
df

       country   GDP country_type
0        india   123   developing
1        nepal   100   developing
2  new zealand   340    developed
3     autralia   600    developed
4       canada  3456    developed
5     pakistan   232   developing

In [56]:
df.iloc[4,1]=345
df

       country  GDP country_type
0        india  123   developing
1        nepal  100   developing
2  new zealand  340    developed
3     autralia  600    developed
4       canada  345    developed
5     pakistan  232   developing

# addition
-  append:
- joining of dataframes

# deletion

In [57]:
df

       country  GDP country_type
0        india  123   developing
1        nepal  100   developing
2  new zealand  340    developed
3     autralia  600    developed
4       canada  345    developed
5     pakistan  232   developing

In [58]:
df.drop(index=[4])

       country  GDP country_type
0        india  123   developing
1        nepal  100   developing
2  new zealand  340    developed
3     autralia  600    developed
5     pakistan  232   developing

In [59]:
df.drop(index=[2,4,5])

    country  GDP country_type
0     india  123   developing
1     nepal  100   developing
3  autralia  600    developed

# columns 
- column names fetching
- columns fetching
- columns addition
- columns renaming
- columns re ordering
- columns drop

In [60]:
df

       country  GDP country_type
0        india  123   developing
1        nepal  100   developing
2  new zealand  340    developed
3     autralia  600    developed
4       canada  345    developed
5     pakistan  232   developing

# fetching columns names

In [61]:
df.columns

Index(['country', 'GDP', 'country_type'], dtype='object')

# single column fetching

In [62]:
df["GDP"]

0    123
1    100
2    340
3    600
4    345
5    232
Name: GDP, dtype: int64

In [63]:
df.GDP

0    123
1    100
2    340
3    600
4    345
5    232
Name: GDP, dtype: int64

## MULTIPLE COLUMNS

In [64]:
df[["GDP","country"]]

   GDP      country
0  123        india
1  100        nepal
2  340  new zealand
3  600     autralia
4  345       canada
5  232     pakistan

# column addition

- fresh column
-  extract new column from existing one

In [66]:
df

       country  GDP country_type
0        india  123   developing
1        nepal  100   developing
2  new zealand  340    developed
3     autralia  600    developed
4       canada  345    developed
5     pakistan  232   developing

# df[newcolumn name]=1d

In [67]:
df["currency"]=["rupees","rupiah","dollor","dollar","dollar","rupee"]
df

       country  GDP country_type currency
0        india  123   developing   rupees
1        nepal  100   developing   rupiah
2  new zealand  340    developed   dollor
3     autralia  600    developed   dollar
4       canada  345    developed   dollar
5     pakistan  232   developing    rupee

# traversal in single column

In [68]:
for i in df["GDP"]:
    print(i)

123
100
340
600
345
232

In [69]:
l=[]
for i in df["GDP"]:
    l.append(i+5)
l

[128, 105, 345, 605, 350, 237]

In [70]:
df["gdp+5"]=l
df

       country  GDP country_type currency  gdp+5
0        india  123   developing   rupees    128
1        nepal  100   developing   rupiah    105
2  new zealand  340    developed   dollor    345
3     autralia  600    developed   dollar    605
4       canada  345    developed   dollar    350
5     pakistan  232   developing    rupee    237

# or

In [71]:
df["gdp+five"]=df["GDP"]+5
df

       country  GDP country_type currency  gdp+5  gdp+five
0        india  123   developing   rupees    128       128
1        nepal  100   developing   rupiah    105       105
2  new zealand  340    developed   dollor    345       345
3     autralia  600    developed   dollar    605       605
4       canada  345    developed   dollar    350       350
5     pakistan  232   developing    rupee    237       237

# column drop

In [72]:
df.drop(columns=["gdp+5","gdp+five"],inplace=True)

In [73]:
df

       country  GDP country_type currency
0        india  123   developing   rupees
1        nepal  100   developing   rupiah
2  new zealand  340    developed   dollor
3     autralia  600    developed   dollar
4       canada  345    developed   dollar
5     pakistan  232   developing    rupee

# column renaming

In [74]:
df

       country  GDP country_type currency
0        india  123   developing   rupees
1        nepal  100   developing   rupiah
2  new zealand  340    developed   dollor
3     autralia  600    developed   dollar
4       canada  345    developed   dollar
5     pakistan  232   developing    rupee

In [75]:
df.rename(columns={"GDP":"gdp"},inplace=True)

In [76]:
df

       country  gdp country_type currency
0        india  123   developing   rupees
1        nepal  100   developing   rupiah
2  new zealand  340    developed   dollor
3     autralia  600    developed   dollar
4       canada  345    developed   dollar
5     pakistan  232   developing    rupee

# columns re ordering

In [77]:
df1=df[["country","country_type","currency","gdp"]]
df1

       country country_type currency  gdp
0        india   developing   rupees  123
1        nepal   developing   rupiah  100
2  new zealand    developed   dollor  340
3     autralia    developed   dollar  600
4       canada    developed   dollar  345
5     pakistan   developing    rupee  232

# series: 1d
- from read_scv
- from list
- from dictionary
- from array
- from tuple

In [85]:
m=pd.read_csv("C:\\PRANAV\\Madrid Software\\Python\\data sets\\examples\\series.csv")
m

     Name
0  prachi
1  ritika
2     jai
3   leena

# from list

In [86]:
s=["pranav","ds",89,"50k"]
s1=pd.Series(s)
s1

0    pranav
1        ds
2        89
3       50k
dtype: object

In [87]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [88]:
s1.values

array(['pranav', 'ds', 89, '50k'], dtype=object)

In [89]:
s1=pd.Series(s,index=["name","course","marks","fees"])
s1

name      pranav
course        ds
marks         89
fees         50k
dtype: object

# from dict

In [90]:
d={"name":"pranav","course":"ds","marks":70}
s=pd.Series(d)
s

name      pranav
course        ds
marks         70
dtype: object

In [91]:
s["name"]

'pranav'

In [92]:
s.loc["course":]

course    ds
marks     70
dtype: object

# series to data frame

In [93]:
s

name      pranav
course        ds
marks         70
dtype: object

In [94]:
d1=s.to_frame()
d1

             0
name    pranav
course      ds
marks       70

In [95]:
d1.unstack() #series

0  name      pranav
   course        ds
   marks         70
dtype: object

# info,dtypes, astype

In [102]:
df=pd.DataFrame({"name":["riya","noor","nikhil","jai","jai"],"weight":["67","68","72","55","58"],"height":["152 cm","153","156 CM","155","159 cm"]})
df

     name weight  height
0    riya     67  152 cm
1    noor     68     153
2  nikhil     72  156 CM
3     jai     55     155
4     jai     58  159 cm

In [103]:
df.dtypes

name      object
weight    object
height    object
dtype: object

In [104]:
df1=df.select_dtypes(include="object")
df1

     name weight  height
0    riya     67  152 cm
1    noor     68     153
2  nikhil     72  156 CM
3     jai     55     155
4     jai     58  159 cm

In [105]:
df2=df.select_dtypes(exclude="object")
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [101]:
df1

     name weight  height
0    riya     67  152 cm
1    noor     68     153
2  nikhil     72  156 CM
3     jai     55     155
4     jai     58  159 cm

In [106]:
df.select_dtypes(include="object").columns

Index(['name', 'weight', 'height'], dtype='object')

In [107]:
df

     name weight  height
0    riya     67  152 cm
1    noor     68     153
2  nikhil     72  156 CM
3     jai     55     155
4     jai     58  159 cm

# avg weight

In [109]:
df

     name weight  height
0    riya     67  152 cm
1    noor     68     153
2  nikhil     72  156 CM
3     jai     55     155
4     jai     58  159 cm

In [108]:
df["weight"].mean()

TypeError: Could not convert string '6768725558' to numeric

In [110]:
df["weight"].dtypes

dtype('O')

In [111]:
df[["weight","height"]].dtypes

weight    object
height    object
dtype: object

In [112]:
df.dtypes

name      object
weight    object
height    object
dtype: object

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   weight  5 non-null      object
 2   height  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [114]:
df["weight"]=df["weight"].astype(float)

In [115]:
df["weight"].dtypes

dtype('float64')

In [116]:
df["weight"].mean()

64.0

In [117]:
df["height"]=df["height"].astype(float)

ValueError: could not convert string to float: '152 cm'